brew "bat"
brew "btop"
brew "eza"
brew "fd"
brew "fzf"
brew "git-delta"
brew "gnupg"
brew "jq"
brew "lazygit"
brew "mise"
brew "neovim"
brew "ripgrep"
brew "starship"
brew "stow"
brew "tmux"
brew "watch"
brew "wget"
brew "yazi"
brew "yq"
brew "zoxide"
flatpak "com.visualstudio.code"
